Revit 2027 API
ExportFontKey(String) Constructor
 Constructs a new ExportFontKey using an input font name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportFontKey(
	string originalFontName
)
Public Sub New (
	originalFontName As String
)
public:
ExportFontKey(
	String^ originalFontName
)
new :
        originalFontName : string -> ExportFontKey
Parameters
originalFontName String
 The original font name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportFontKey Class
ExportFontKey Overload
Autodesk.Revit.DB Namespace